posts/problem-solving-techniques-invariants.org
#+BEGIN_COMMENT
.. title: Problem-Solving Techniques: Invariants
.. slug: problem-solving-techniques-invariants
.. date: 2020-01-07 12:26:06 UTC-05:00
.. tags: math, cs
.. category: problem-solving-techniques
.. link: 
.. description: Using invariants for clever solutions to problems
.. type: text
.. has_math: true
#+END_COMMENT
There are a lot of clever proofs in mathematics and computer science. I've already talked about some
of them, and I hope to do a lot more of it on this blog. There's often a certain separation that I
feel when I read something particularly creative or beautiful: this is amazing, but how could I ever
hope to produce something like it? Is real aesthetic achievement in these fields limited to those
with a natural talent I lack? 

I'm still not sure about that last question, but I do know that, like anything, it is possible to
improve at creative problem-solving through practice. The people I've known who have been best at
doing creative math—the kind that makes perfect sense when you see it but seems impossible to find
if you don't already know it—have built up vast toolboxes of concepts and ideas that are useful in
many different ways across mathematics and computer science. These aren't solutions for a single
problem: they're meta-solutions that serve as an archetype for solutions to a diverse array of
problems. In my experience, the size of that toolbox is what, more than anything else, determines
how effectively one can find creative, novel ways of approaching problems. I'll be talking about one
such tool today: invariants.

{{{TEASER_END}}}

* What is an Invariant?

{{{mn}}}
Angle, length, and volume are also all invariant under translation, reflection, and rotation. In
fact, we might define /geometry/, at least the kind taught in high school, as the study of properties
invariant under these operations.
{{{mn-end}}}

An /invariant/ is a property of something—any mathematical object or system you can think of—that
doesn't change under some type of transformation. A really simple example is that the area of a
shape is invariant under translation, rotation, or reflection. 

* Why Do We Care?
The idea that area is invariant under these types of transformations is probably something you
already knew. Thinking about it like this, though, lets us easily use it in ways that aren't
entirely obvious otherwise.

Take, for example, the problem of determining if two triangles are congruent: that is, if one can be
mapped onto the other through transformation, rotation, and reflection. In high school geometry you
learn that three sides determine a triangle, called /SSS congruence/, and also that two sides and the
angle between then does the same thing, called /SAS congruence/. If the three side lengths or two side
lengths and the angle between them match between two triangles, then we know that they can be mapped
to one another. You also might learn that two sides and an angle not between both of them does not
establish congruence. This isn't intuitively obvious to many, and spurious "SSA congruence" is the
source of a lot of confusion in geometry classes.

One way you might intuit that this doesn't work is that SSS and SAS come with associated formulae
for the area of their corresponding triangle: because area is invariant under any transformation
between congruent triangles, we know that congruence implies equal area. [[https://en.wikipedia.org/wiki/Heron%2527s_formula][Heron's formula]] gives you
the area of a triangle given its side lengths, and given two side lengths $a$ and $b$ and the angle
$\theta$ between them the area of the resulting triangle is $\frac{1}{2} ab \sin \theta$. No such formula
exists for another angle in the triangle, because two triangles with that configuration may have
different areas. 

I'm interested in the fact that *knowing these formulae can suggest a completely different*
*conjecture about congruence.* Knowing that SSS and SAS define a triangle's /area/ can suggest a
completely different result about transforming triangles into one another.

You might reasonably think that this sort of idea isn't really that noteworthy or interesting, and
you hardly need to think about area as an invariant to come up with SSS or SAS congruence. I would
argue, however, that this jump is only underwhelming because the results it gives us are familiar
already. Let's see how this sort of thinking can be applied to problems with less clear solutions.

* General Terminology

{{{mn}}} 
Note that math has a lot of names for congruence, because we often want to talk about
several kinds of transformations for the same object, and so it's a bit of a pain to keep track
of. Graphs are /isomorphic/, triangles and integers are /congruent/, other objects are /equivalent/,
etc. This concept is incredibly general, and disciplines like category theory provide a really
abstract foundation for these types of relations, but I'm not going there for this post.
{{{mn-end}}}

Because we're going to step outside the realm of synthetic geometry, I want to introduce some
terminology that's not tied to triangles. Let's call any sequence of transformations that fit our
criteria (above, that was any sequence of translation, reflection, and rotation) a /map/. We say two
objects are /congruent/ if they have the same value for an invariant. Note that congruence behaves
like equality (it's reflexive, commutative, and transitive). Thus, we call a class of objects that
all have some specific value for an invariant an /equivalence class/. 

