posts/problem-solving-techniques-invariants/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Using invariants for clever solutions to problems">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Pollard&#8217;s Rho · Problem-Solving Techniques: Invariants </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<!-- Global site tag (gtag.js) - Google Analytics --><meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://nicholas-miklaucic.github.io/posts/problem-solving-techniques-invariants/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nicholas Miklaucic">
<link rel="next" href="../problem-solving-techniques-induction/" title="Problem Solving Techniques: Induction" type="text/html">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

    <div class="hsidebar">
        <div class="container sidebar-sticky">
            <div class="sidebar-about">
              <h1>
                <a href="https://nicholas-miklaucic.github.io/">
                      <h1 id="brand"><a class="no-tufte-underline" href="https://nicholas-miklaucic.github.io/" title="Pollard's Rho" rel="home">

        <span id="blog-title">Pollard&#8217;s&nbsp;Rho</span>
    </a></h1>

                </a>
              </h1>
                <p class="lead">Thoughts on math, computing, and&nbsp;data</p>

            </div>
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="no-tufte-underline sidebar-nav-item" href="../../pages/about-me/">About Me</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../rss.xml">RSS feed</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2020         <a href="mailto:nicholas.miklaucic@gmail.com">Nicholas Miklaucic</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>

    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Problem-Solving Techniques:&nbsp;Invariants</a></h1>

    <span class="post-date">
      <time class="published dt-published" datetime="2020-01-07T12:26:06-05:00" itemprop="datePublished" title="2020-01-07 12:26">2020-01-07 12:26</time></span>
        <meta name="description" itemprop="description" content="Using invariants for clever solutions to problems">
<div class="e-content entry-content" itemprop="articleBody text">
    <p>
There are a lot of clever proofs in mathematics and computer science. I&#8217;ve already talked about some
of them, and I hope to do a lot more of it on this blog. There&#8217;s often a certain separation that I
feel when I read something particularly creative or beautiful: this is amazing, but how could I ever
hope to produce something like it? Is real aesthetic achievement in these fields limited to those
with a natural talent I&nbsp;lack? 
</p>

<p>
I&#8217;m still not sure about that last question, but I do know that, like anything, it is possible to
improve at creative problem-solving through practice. The people I&#8217;ve known who have been best at
doing creative math—the kind that makes perfect sense when you see it but seems impossible to find
if you don&#8217;t already know it—have built up vast toolboxes of concepts and ideas that are useful in
many different ways across mathematics and computer science. These aren&#8217;t solutions for a single
problem: they&#8217;re meta-solutions that serve as an archetype for solutions to a diverse array of
problems. In my experience, the size of that toolbox is what, more than anything else, determines
how effectively one can find creative, novel ways of approaching problems. I&#8217;ll be talking about one
such tool today:&nbsp;invariants.
</p>

<!-- TEASER_END -->

<div id="outline-container-org9cea640" class="outline-2">
<h2 id="org9cea640">What is an&nbsp;Invariant?</h2>
<div class="outline-text-2" id="text-org9cea640">
<span class="marginnote"><p>
</p>
<p>
Angle, length, and volume are also all invariant under translation, reflection, and rotation. In
fact, we might define <i>geometry</i>, at least the kind taught in high school, as the study of properties
invariant under these&nbsp;operations.
</p>
</span>

<p>
An <i>invariant</i> is a property of something—any mathematical object or system you can think of—that
doesn&#8217;t change under some type of transformation. A really simple example is that the area of a
shape is invariant under translation, rotation, or&nbsp;reflection. 
</p>
</div>
</div>

<div id="outline-container-org3db1960" class="outline-2">
<h2 id="org3db1960">Why Do We&nbsp;Care?</h2>
<div class="outline-text-2" id="text-org3db1960">
<p>
The idea that area is invariant under these types of transformations is probably something you
already knew. Thinking about it like this, though, lets us easily use it in ways that aren&#8217;t
entirely obvious&nbsp;otherwise.
</p>

<p>
Take, for example, the problem of determining if two triangles are congruent: that is, if one can be
mapped onto the other through transformation, rotation, and reflection. In high school geometry you
learn that three sides determine a triangle, called <i>SSS congruence</i>, and also that two sides and the
angle between then does the same thing, called <i>SAS congruence</i>. If the three side lengths or two side
lengths and the angle between them match between two triangles, then we know that they can be mapped
to one another. You also might learn that two sides and an angle not between both of them does not
establish congruence. This isn&#8217;t intuitively obvious to many, and spurious &#8220;SSA congruence&#8221; is the
source of a lot of confusion in geometry&nbsp;classes.
</p>

<p>
One way you might intuit that this doesn&#8217;t work is that SSS and SAS come with associated formulae
for the area of their corresponding triangle: because area is invariant under any transformation
between congruent triangles, we know that congruence implies equal area. <a href="https://en.wikipedia.org/wiki/Heron%2527s_formula">Heron&#8217;s formula</a> gives you
the area of a triangle given its side lengths, and given two side lengths \(a\) and \(b\) and the angle
\(\theta\) between them the area of the resulting triangle is \(\frac{1}{2} ab \sin \theta\). No such formula
exists for another angle in the triangle, because two triangles with that configuration may have
different&nbsp;areas. 
</p>

<p>
I&#8217;m interested in the fact that <b>knowing these formulae can suggest a completely different</b>
<b>conjecture about congruence.</b> Knowing that SSS and SAS define a triangle&#8217;s <i>area</i> can suggest a
completely different result about transforming triangles into one&nbsp;another.
</p>

<p>
You might reasonably think that this sort of idea isn&#8217;t really that noteworthy or interesting, and
you hardly need to think about area as an invariant to come up with SSS or SAS congruence. I would
argue, however, that this jump is only underwhelming because the results it gives us are familiar
already. Let&#8217;s see how this sort of thinking can be applied to problems with less clear&nbsp;solutions.
</p>
</div>
</div>

<div id="outline-container-org4934a2a" class="outline-2">
<h2 id="org4934a2a">General&nbsp;Terminology</h2>
<div class="outline-text-2" id="text-org4934a2a">
<span class="marginnote"><p>
</p>
<p>
Note that math has a lot of names for congruence, because we often want to talk about
several kinds of transformations for the same object, and so it&#8217;s a bit of a pain to keep track
of. Graphs are <i>isomorphic</i>, triangles and integers are <i>congruent</i>, other objects are <i>equivalent</i>,
etc. This concept is incredibly general, and disciplines like category theory provide a really
abstract foundation for these types of relations, but I&#8217;m not going there for this&nbsp;post.
</p>
</span>

<p>
Because we&#8217;re going to step outside the realm of synthetic geometry, I want to introduce some
terminology that&#8217;s not tied to triangles. Let&#8217;s call any sequence of transformations that fit our
criteria (above, that was any sequence of translation, reflection, and rotation) a <i>map</i>. We say two
objects are <i>congruent</i> if they have the same value for an invariant. Note that congruence behaves
like equality (it&#8217;s reflexive, commutative, and transitive). Thus, we call a class of objects that
all have some specific value for an invariant an <i>equivalence class</i>. 
</p>
</div>
</div>
