posts/problem-solving-techniques-invariants.org
* A Cooler Example
Imagine we have a grid and we can place 1x2 dominoes in that grid. There are all sorts of shapes we
can make by placing these dominoes in different ways: we could make a 2x2 square, a 1x4 line, most
of the Tetris pieces, you get the idea. There are also some shapes we can't make: a 1x1 square, for
example, obviously can't be made by placing dominoes like this.

Imagine the shape created by an 8x8 square where two diagonally-opposite corners are removed. I'll
call it the /mutilated square./ Here's the problem: can we make this shape by tiling dominoes?

I highly encourage you to try doing this yourself. You might find it easier to start with smaller
shapes: a 4x4 square with the same removed corners, a 3x4 rectangle, you name it. 

You should (hopefully!) find that tiling the 8x8 mutilated square isn't easy. You might conjecture
that it's impossible once you've tried it. The question is: how could we go about proving that this
tiling is truly impossible and not just difficult to find?

I have no doubt there exists a laborious, tedious proof of this that basically starts with smaller
shapes and grows up from there, with lots of casework about how you place your starting domino and
the resulting shape. This is about creative, cool proofs, however, and you might infer from the
fact that I'm talking about this that we can use an invariant to solve this elegantly.

Why might we think to try using an invariant (the problems you have elsewhere probably won't have
"Invariants" in the website title!) when there are so many possible options for a proof, some of
which are probably successful if inelegant? Knowing how to recognize problems that invariants might
be fruitfully applied to is as important as knowing how to use invariants.

In this case, we're trying to show that a certain kind of map—repeatedly adding or removing a 1x2
domino adjoining the current shape—can't transform one object, the empty shape with no dominoes
placed, into another, the 8x8 mutilated square. Showing that no such map exists is not an easy task,
because there are a lot of possible sequences and it's hard to reason about the whole space of every
possible attempt to tile the mutilated square.

Enter invariants: problems about objects under transformations are usually an extremely good fit for
this tool. Now we know to try this method. The question is, how do we apply this technique?

* The Handy-Dandy Pollard's Rho Guide to Using Invariants
I'm going to break this up into a couple of distinct steps.

1. Clearly define the underlying transformation and mathematical objects that the problem uses. The
   problem should be of the form "does there exist a map that maps X to Y?" (That is, are X and Y
   equivalent?)
2. Identify possible invariants under this transformation.
3. Check your invariants to see if any of them differ between the start and target objects.
4. If any invariants differ, then simply showing that combined with proving the invariance of the
   property you're using completes the proof that no such transformation sequence exists.
5. If none of the invariants differ but you're convinced the transformation really is impossible,
   then go back to step 2.
6. If none of the invariants differ and you're not convinced the transformation is impossible, try
   to find such a transformation. Your invariants can still be helpful: think of simple base cases
   that match the invariants and try to find a way to map an arbitrary object to that base
   case. Because most of these transformations are reversible, this allows you to interconvert
   between any two arbitrary objects X and Y: transform X into the base, and transform the base into
   Y.

We've already done the first step: our object is "shapes made through tiling dominoes on a grid",
and our transformation is "adding or removing dominoes." Let's move on to step 2. What properties
does this transformation preserve? If you're following along, try to do this yourself. Here's the
first one I thought of: the parity ("evenness") of the shape's area. The dominoes have even area,
and so adding them can't make a shape with odd area have even area or vice versa. Parity is the most
common form of invariant in lots of discrete problems, and so it's a good starting choice.

On to step 3. Can area parity solve our problem? Sadly, the answer is no: the 8x8 mutilated square
has area 62, and the empty shape has area 0, both of which have the same area parity. (This would
work if our starting shape was a single 1x1 square, for example, but that's not this problem.)

You might continue trying to tile the mutilated square: perhaps there really is a way to do
it. (These decisions are what separates a meta-solution from a solution: this is an archetype for
solutions, but it's not completely formulaic to apply.) It really isn't possible, though, so you're
probably not going to get very far.

I liked the parity idea, though: is there some way of using parity in a different way? As it turns
out, there is!

{{{mn}}}
If you want a more rigorous definition of parity, something like this will do. /Parity/ is some way of
assigning "even" and "odd" to objects that can be combined in some way such that combining two even
objects results in an even object, combining two odd objects results in an even object, and
combining an even and odd object results in an odd object.
{{{mn-end}}}

I have some fessing up to do. I've been a little coy with my terminology: this problem is usually
framed as the /mutilated/ /chessboard problem./ Chessboards have an interesting variant of parity:
they're alternately colored black and white. It may seem like a stretch to call this parity, but it
really isn't. We could imagine assigning each square a coordinate, where $(0, 0)$ is the bottom left
and $(1, 0)$ is the square to the right of that. A normal chessboard is colored so that any square
at coordinate $(x, y)$ is black if $x + y$ is even and white if $x + y$ is odd: a square's color
reflects its parity.

Note that a domino always covers one even square and one odd square. Thus, the difference between
the number of even and odd squares in a shape is an invariant under our transformation! I'm going to
call this difference the /parity balance./ Parity balance works perfectly for our problem: the normal
8x8 chessboard had the same number of white and black squares, but on a chessboard the opposing
diagonal corners are the same color. We removed two of them, so the resulting shape has a net
imbalance: it has two more black squares than white squares. Our starting empty shape has no such
imbalance, and so there's no way to create the mutilated chessboard under our invariant.

Note that formalizing this into a proof isn't quite done, but we have the essential creative insight
that's needed to solve the problem. The rest is just formally proving that our domino tiling can't
change the balance of black and white squares and showing that the invariant really is different
between the shapes.

