posts/problem-solving-techniques-invariants/index.html

<div id="outline-container-org6593c73" class="outline-2">
<h2 id="org6593c73">A Cooler&nbsp;Example</h2>
<div class="outline-text-2" id="text-org6593c73">
<p>
Imagine we have a grid and we can place 1x2 dominoes in that grid. There are all sorts of shapes we
can make by placing these dominoes in different ways: we could make a 2x2 square, a 1x4 line, most
of the Tetris pieces, you get the idea. There are also some shapes we can&#8217;t make: a 1x1 square, for
example, obviously can&#8217;t be made by placing dominoes like&nbsp;this.
</p>

<p>
Imagine the shape created by an 8x8 square where two diagonally-opposite corners are removed. I&#8217;ll
call it the <i>mutilated square.</i> Here&#8217;s the problem: can we make this shape by tiling&nbsp;dominoes?
</p>

<p>
I highly encourage you to try doing this yourself. You might find it easier to start with smaller
shapes: a 4x4 square with the same removed corners, a 3x4 rectangle, you name&nbsp;it. 
</p>

<p>
You should (hopefully!) find that tiling the 8x8 mutilated square isn&#8217;t easy. You might conjecture
that it&#8217;s impossible once you&#8217;ve tried it. The question is: how could we go about proving that this
tiling is truly impossible and not just difficult to&nbsp;find?
</p>

<p>
I have no doubt there exists a laborious, tedious proof of this that basically starts with smaller
shapes and grows up from there, with lots of casework about how you place your starting domino and
the resulting shape. This is about creative, cool proofs, however, and you might infer from the
fact that I&#8217;m talking about this that we can use an invariant to solve this&nbsp;elegantly.
</p>

<p>
Why might we think to try using an invariant (the problems you have elsewhere probably won&#8217;t have
&#8220;Invariants&#8221; in the website title!) when there are so many possible options for a proof, some of
which are probably successful if inelegant? Knowing how to recognize problems that invariants might
be fruitfully applied to is as important as knowing how to use&nbsp;invariants.
</p>

<p>
In this case, we&#8217;re trying to show that a certain kind of map—repeatedly adding or removing a 1x2
domino adjoining the current shape—can&#8217;t transform one object, the empty shape with no dominoes
placed, into another, the 8x8 mutilated square. Showing that no such map exists is not an easy task,
because there are a lot of possible sequences and it&#8217;s hard to reason about the whole space of every
possible attempt to tile the mutilated&nbsp;square.
</p>

<p>
Enter invariants: problems about objects under transformations are usually an extremely good fit for
this tool. Now we know to try this method. The question is, how do we apply this&nbsp;technique?
</p>
</div>
</div>

<div id="outline-container-orgc29e315" class="outline-2">
<h2 id="orgc29e315">The Handy-Dandy Pollard&#8217;s Rho Guide to Using&nbsp;Invariants</h2>
<div class="outline-text-2" id="text-orgc29e315">
<p>
I&#8217;m going to break this up into a couple of distinct&nbsp;steps.
</p>

<ol class="org-ol">
<li>Clearly define the underlying transformation and mathematical objects that the problem uses. The
problem should be of the form &#8220;does there exist a map that maps X to Y?&#8221; (That is, are X and Y&nbsp;equivalent?)</li>
<li>Identify possible invariants under this&nbsp;transformation.</li>
<li>Check your invariants to see if any of them differ between the start and target&nbsp;objects.</li>
<li>If any invariants differ, then simply showing that combined with proving the invariance of the
property you&#8217;re using completes the proof that no such transformation sequence&nbsp;exists.</li>
<li>If none of the invariants differ but you&#8217;re convinced the transformation really is impossible,
then go back to step&nbsp;2.</li>
<li>If none of the invariants differ and you&#8217;re not convinced the transformation is impossible, try
to find such a transformation. Your invariants can still be helpful: think of simple base cases
that match the invariants and try to find a way to map an arbitrary object to that base
case. Because most of these transformations are reversible, this allows you to interconvert
between any two arbitrary objects X and Y: transform X into the base, and transform the base into&nbsp;Y.</li>
</ol>
<p>
We&#8217;ve already done the first step: our object is &#8220;shapes made through tiling dominoes on a grid&#8221;,
and our transformation is &#8220;adding or removing dominoes.&#8221; Let&#8217;s move on to step 2. What properties
does this transformation preserve? If you&#8217;re following along, try to do this yourself. Here&#8217;s the
first one I thought of: the parity (&#8220;evenness&#8221;) of the shape&#8217;s area. The dominoes have even area,
and so adding them can&#8217;t make a shape with odd area have even area or vice versa. Parity is the most
common form of invariant in lots of discrete problems, and so it&#8217;s a good starting&nbsp;choice.
</p>

<p>
On to step 3. Can area parity solve our problem? Sadly, the answer is no: the 8x8 mutilated square
has area 62, and the empty shape has area 0, both of which have the same area parity. (This would
work if our starting shape was a single 1x1 square, for example, but that&#8217;s not this&nbsp;problem.)
</p>

<p>
You might continue trying to tile the mutilated square: perhaps there really is a way to do
it. (These decisions are what separates a meta-solution from a solution: this is an archetype for
solutions, but it&#8217;s not completely formulaic to apply.) It really isn&#8217;t possible, though, so you&#8217;re
probably not going to get very&nbsp;far.
</p>

<p>
I liked the parity idea, though: is there some way of using parity in a different way? As it turns
out, there&nbsp;is!
</p>

<span class="marginnote"><p>
</p>
<p>
If you want a more rigorous definition of parity, something like this will do. <i>Parity</i> is some way of
assigning &#8220;even&#8221; and &#8220;odd&#8221; to objects that can be combined in some way such that combining two even
objects results in an even object, combining two odd objects results in an even object, and
combining an even and odd object results in an odd&nbsp;object.
</p>
</span>

<p>
I have some fessing up to do. I&#8217;ve been a little coy with my terminology: this problem is usually
framed as the <i>mutilated</i> <i>chessboard problem.</i> Chessboards have an interesting variant of parity:
they&#8217;re alternately colored black and white. It may seem like a stretch to call this parity, but it
really isn&#8217;t. We could imagine assigning each square a coordinate, where \((0, 0)\) is the bottom left
and \((1, 0)\) is the square to the right of that. A normal chessboard is colored so that any square
at coordinate \((x, y)\) is black if \(x + y\) is even and white if \(x + y\) is odd: a square&#8217;s color
reflects its&nbsp;parity.
</p>

<p>
Note that a domino always covers one even square and one odd square. Thus, the difference between
the number of even and odd squares in a shape is an invariant under our transformation! I&#8217;m going to
call this difference the <i>parity balance.</i> Parity balance works perfectly for our problem: the normal
8x8 chessboard had the same number of white and black squares, but on a chessboard the opposing
diagonal corners are the same color. We removed two of them, so the resulting shape has a net
imbalance: it has two more black squares than white squares. Our starting empty shape has no such
imbalance, and so there&#8217;s no way to create the mutilated chessboard under our&nbsp;invariant.
</p>

<p>
Note that formalizing this into a proof isn&#8217;t quite done, but we have the essential creative insight
that&#8217;s needed to solve the problem. The rest is just formally proving that our domino tiling can&#8217;t
change the balance of black and white squares and showing that the invariant really is different
between the&nbsp;shapes.
</p>
</div>
</div>
