posts/problem-solving-techniques-invariants.org
* Generalization
Using invariance is especially fruitful because it suggests a number of other very interesting
questions. Specifically, we know that our two invariants are /necessary/ for a map to exist between
two shapes X and Y. In math, once you've shown that something is necessary, it's often fruitful to
then ask if it's /sufficient/: that any object X can be mapped to any object Y in its equivalence
class. 

Sadly, the answer to this question is no: a counterexample is that a T-shape like the one in Tetris
satisfies both of our invariants but can't be tiled with dominoes.

You might reasonably ask if there is some invariant that is both necessary and sufficient for this
transformation. This is an excellent question! The answer is yes, but it's substantially more
complicated than what I could reasonably introduce here.[[https://www.jstor.org/stable/2324578][ This paper]] (cited in the margin)
establishes such an invariant and shows an approach that can work for other types of tiling. 

{{{mn}}}
Thurston, W. (1990). Conway's Tiling Groups. The American Mathematical Monthly, 97(8), 757-773. doi:10.2307/2324578
{{{mn-end}}}

* Gallery
Now that we've developed one example in full, I want to quickly run through a bunch of other
problems where invariants are useful as a way to aid the reader in recognizing possible invariants
in other problems. I'm not going to go in-depth on any of them, but I'll provide links for the
interested reader to learn more.

** The 15 puzzle
There's a famous sliding block [[https://en.wikipedia.org/wiki/15_puzzle][puzzle]] that starts with a 4x4 grid tiled with numbers, with the last
16 tile missing. The task is to switch the 14 and 15 tiles. There's a parity invariant, a bit too
complicated to get into here, that shows that this puzzle is impossible in its standard form: this
didn't stop Sam Loyd, famed puzzle author, from offering $1,000 for doing just that!
** Rubik's Cube
There's another parity invariant here that applies to the standard Rubik's cube: it's impossible to
switch two adjacent edge pieces without doing anything else. (If you have any friends who solve
Rubik's cubes, this is good for a laugh: dissassemble two edges and switch them, then shuffle the
whole thing and see how long it takes them to figure it out.) As it happens, this parity combined
with the orientation of the corners is sufficient for two cubes to be congruent: there are 12 such
equivalence classes, and so a cube randomly disassembled and put back together has only a 1 in 12
chance of being soluble.
** Polygon Dissection
Given two polygons, can you cut one into pieces and reassemble them to get the other? The invariant
that is most useful here is area. Satisfyingly, unlike our dominoes, this time area is both
necessary and sufficient for two shapes to be "scissors-congruent" (to distinguish it from normal
congruence of shapes), a fact proved by the [[https://en.wikipedia.org/wiki/Wallace%25E2%2580%2593Bolyai%25E2%2580%2593Gerwien_theorem][Wallace-Bolyai-Gerwien theorem]]. 
** Polyhedra Dissection
Extending the Wallace-Bolyai-Gerwien theorem to polyhedra was a famous problem, included on David
Hilbert's seminal list of problems presented in 1900 as important directions for future
mathematics. Can any two polyhedra with equal volume be transformed into each other by cutting and
rearranging pieces? This problem, the third on Hilbert's list, was solved by Max Dehn that very same
year: no, it isn't always possible. There's a second invariant, called the /Dehn invariant/, that
involves the angles of different edges. Volume and the Dehn invariant together are sufficient to
show that two polyhedra can be dissected into each other.
** Physical Systems
All sorts of invariants occur in physics problems, depending on the exact transformations being
used: momentum, energy, the speed of light, etc. These are usually called /conservation laws/. Taking
your standard high-school mechanics and reformulating it in terms of invariants can produce some
very important theory, like [[https://en.wikipedia.org/wiki/Lagrangian_mechanics][Lagrangian mechanics]]. There's a very beautiful and deep result that
connects invariants to symmetries called [[https://en.wikipedia.org/wiki/Noether%2527s_theorem][Noether's theorem]].
** Topology
I earlier mentioned that you can think of geometry as the study of invariants under translation,
rotation, and reflection. What if we generalized this list to include any type of continuous
deformation, like stretching or twisting? This question results in a new discipline:
topology. Things like area and angle are no longer preserved, but the weaker invariants that still
hold are incredibly useful. 

For example, the number of holes in an object (playing /very/ fast and loose) is invariant under these
deformations: you can turn a sphere into a cube because they're both completely solid, but you can't
transform either into a torus (a donut shape) without tearing them because the torus has a /genus/
(the formal term for this number of holes) of 1 whereas the sphere and cube have genus 0.
** Theorema Egregium
The [[https://en.wikipedia.org/wiki/Gaussian_curvature?oldformat=true][theorema egregium]] ("remarkable theorem"), proved by Gauss, loosely states that the curvature of
a 2D surface doesn't change depending on how you bend it in 3D space. For example, you can't bend an
orange peel until it's perfectly flat without breaking it somewhere because the sphere has curvature.

This is one of my favorite results from this field because it's so accessible and intuitive in its
practical applications. Imagine a piece of pizza. It's easy to bend if you lay it flat, because
there are two degrees of freedom: the tip can curve down and the slice can remain flat (under the
definition of curvature that we're using) because one of the axes (the one parallel to the crust) is
still flat. If we restrict this by curving the slice along the axis parallel to the crust, it
reduces the ability of the shape to curve in the other direction because it still has to be
flat. Or, put another way, folding pizza makes it more stable!

