posts/problem-solving-techniques-invariants/index.html

<div id="outline-container-org4609f31" class="outline-2">
<h2 id="org4609f31">Generalization</h2>
<div class="outline-text-2" id="text-org4609f31">
<p>
Using invariance is especially fruitful because it suggests a number of other very interesting
questions. Specifically, we know that our two invariants are <i>necessary</i> for a map to exist between
two shapes X and Y. In math, once you&#8217;ve shown that something is necessary, it&#8217;s often fruitful to
then ask if it&#8217;s <i>sufficient</i>: that any object X can be mapped to any object Y in its equivalence&nbsp;class. 
</p>

<p>
Sadly, the answer to this question is no: a counterexample is that a T-shape like the one in Tetris
satisfies both of our invariants but can&#8217;t be tiled with&nbsp;dominoes.
</p>

<p>
You might reasonably ask if there is some invariant that is both necessary and sufficient for this
transformation. This is an excellent question! The answer is yes, but it&#8217;s substantially more
complicated than what I could reasonably introduce here.<a href="https://www.jstor.org/stable/2324578"> This paper</a> (cited in the margin)
establishes such an invariant and shows an approach that can work for other types of&nbsp;tiling. 
</p>

<span class="marginnote"><p>
</p>
<p>
Thurston, W. (1990). Conway&#8217;s Tiling Groups. The American Mathematical Monthly, 97(8), 757-773. <a href="10.2307/2324578">10.2307/2324578</a>
</p>
</span>
</div>
</div>

<div id="outline-container-org7b661c4" class="outline-2">
<h2 id="org7b661c4">Gallery</h2>
<div class="outline-text-2" id="text-org7b661c4">
<p>
Now that we&#8217;ve developed one example in full, I want to quickly run through a bunch of other
problems where invariants are useful as a way to aid the reader in recognizing possible invariants
in other problems. I&#8217;m not going to go in-depth on any of them, but I&#8217;ll provide links for the
interested reader to learn&nbsp;more.
</p>
</div>

<div id="outline-container-org1fd45ce" class="outline-3">
<h3 id="org1fd45ce">The 15&nbsp;puzzle</h3>
<div class="outline-text-3" id="text-org1fd45ce">
<p>
There&#8217;s a famous sliding block <a href="https://en.wikipedia.org/wiki/15_puzzle">puzzle</a> that starts with a 4x4 grid tiled with numbers, with the last
16 tile missing. The task is to switch the 14 and 15 tiles. There&#8217;s a parity invariant, a bit too
complicated to get into here, that shows that this puzzle is impossible in its standard form: this
didn&#8217;t stop Sam Loyd, famed puzzle author, from offering $1,000 for doing just&nbsp;that!
</p>
</div>
</div>
<div id="outline-container-org7c66b3c" class="outline-3">
<h3 id="org7c66b3c">Rubik&#8217;s&nbsp;Cube</h3>
<div class="outline-text-3" id="text-org7c66b3c">
<p>
There&#8217;s another parity invariant here that applies to the standard Rubik&#8217;s cube: it&#8217;s impossible to
switch two adjacent edge pieces without doing anything else. (If you have any friends who solve
Rubik&#8217;s cubes, this is good for a laugh: dissassemble two edges and switch them, then shuffle the
whole thing and see how long it takes them to figure it out.) As it happens, this parity combined
with the orientation of the corners is sufficient for two cubes to be congruent: there are 12 such
equivalence classes, and so a cube randomly disassembled and put back together has only a 1 in 12
chance of being&nbsp;soluble.
</p>
</div>
</div>
<div id="outline-container-orgfb84e14" class="outline-3">
<h3 id="orgfb84e14">Polygon&nbsp;Dissection</h3>
<div class="outline-text-3" id="text-orgfb84e14">
<p>
Given two polygons, can you cut one into pieces and reassemble them to get the other? The invariant
that is most useful here is area. Satisfyingly, unlike our dominoes, this time area is both
necessary and sufficient for two shapes to be &#8220;scissors-congruent&#8221; (to distinguish it from normal
congruence of shapes), a fact proved by the <a href="https://en.wikipedia.org/wiki/Wallace%25E2%2580%2593Bolyai%25E2%2580%2593Gerwien_theorem">Wallace-Bolyai-Gerwien theorem</a>. 
</p>
</div>
</div>
<div id="outline-container-org53bd94b" class="outline-3">
<h3 id="org53bd94b">Polyhedra&nbsp;Dissection</h3>
<div class="outline-text-3" id="text-org53bd94b">
<p>
Extending the Wallace-Bolyai-Gerwien theorem to polyhedra was a famous problem, included on David
Hilbert&#8217;s seminal list of problems presented in 1900 as important directions for future
mathematics. Can any two polyhedra with equal volume be transformed into each other by cutting and
rearranging pieces? This problem, the third on Hilbert&#8217;s list, was solved by Max Dehn that very same
year: no, it isn&#8217;t always possible. There&#8217;s a second invariant, called the <i>Dehn invariant</i>, that
involves the angles of different edges. Volume and the Dehn invariant together are sufficient to
show that two polyhedra can be dissected into each&nbsp;other.
</p>
</div>
</div>
<div id="outline-container-org5460cc6" class="outline-3">
<h3 id="org5460cc6">Physical&nbsp;Systems</h3>
<div class="outline-text-3" id="text-org5460cc6">
<p>
All sorts of invariants occur in physics problems, depending on the exact transformations being
used: momentum, energy, the speed of light, etc. These are usually called <i>conservation laws</i>. Taking
your standard high-school mechanics and reformulating it in terms of invariants can produce some
very important theory, like <a href="https://en.wikipedia.org/wiki/Lagrangian_mechanics">Lagrangian mechanics</a>. There&#8217;s a very beautiful and deep result that
connects invariants to symmetries called <a href="https://en.wikipedia.org/wiki/Noether%2527s_theorem">Noether&#8217;s theorem</a>.
</p>
</div>
</div>
<div id="outline-container-orge5c8ca7" class="outline-3">
<h3 id="orge5c8ca7">Topology</h3>
<div class="outline-text-3" id="text-orge5c8ca7">
<p>
I earlier mentioned that you can think of geometry as the study of invariants under translation,
rotation, and reflection. What if we generalized this list to include any type of continuous
deformation, like stretching or twisting? This question results in a new discipline:
topology. Things like area and angle are no longer preserved, but the weaker invariants that still
hold are incredibly&nbsp;useful. 
</p>

<p>
For example, the number of holes in an object (playing <i>very</i> fast and loose) is invariant under these
deformations: you can turn a sphere into a cube because they&#8217;re both completely solid, but you can&#8217;t
transform either into a torus (a donut shape) without tearing them because the torus has a <i>genus</i>
(the formal term for this number of holes) of 1 whereas the sphere and cube have genus&nbsp;0.
</p>
</div>
</div>
<div id="outline-container-orgb6e1c00" class="outline-3">
<h3 id="orgb6e1c00">Theorema&nbsp;Egregium</h3>
<div class="outline-text-3" id="text-orgb6e1c00">
<p>
The <a href="https://en.wikipedia.org/wiki/Gaussian_curvature?oldformat=true">theorema egregium</a> (&#8220;remarkable theorem&#8221;), proved by Gauss, loosely states that the curvature of
a 2D surface doesn&#8217;t change depending on how you bend it in 3D space. For example, you can&#8217;t bend an
orange peel until it&#8217;s perfectly flat without breaking it somewhere because the sphere has&nbsp;curvature.
</p>

<p>
This is one of my favorite results from this field because it&#8217;s so accessible and intuitive in its
practical applications. Imagine a piece of pizza. It&#8217;s easy to bend if you lay it flat, because
there are two degrees of freedom: the tip can curve down and the slice can remain flat (under the
definition of curvature that we&#8217;re using) because one of the axes (the one parallel to the crust) is
still flat. If we restrict this by curving the slice along the axis parallel to the crust, it
reduces the ability of the shape to curve in the other direction because it still has to be
flat. Or, put another way, folding pizza makes it more&nbsp;stable!
</p>
</div>
</div>
</div>
